In [1]:
import pandas as pd

## Series

In [2]:
data = [1,2,3,4,5]

In [4]:
s = pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
index = ['Linha' + str(i) for i in range(5)]

In [10]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [11]:
s = pd.Series(index=index, data=data)

In [12]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [13]:
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [14]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [15]:
s = pd.Series(data)

In [16]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [17]:
s1 = s + 1

In [18]:
s1

Linha0    2
Linha1    3
Linha2    4
Linha3    5
Linha4    6
dtype: int64

In [19]:
s2 = s + s1

In [20]:
s2

Linha0     3
Linha1     5
Linha2     7
Linha3     9
Linha4    11
dtype: int64

## DataFrames

In [23]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [24]:
df1 = pd.DataFrame(data=data)

In [25]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [27]:
index = ['Linha' + str(i) for i in range(3)]

In [28]:
df1 = pd.DataFrame(data=data,index=index)

In [29]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [30]:
columns = [f'Coluna{i}' for i in range(3)]

In [31]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)

In [32]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [33]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [34]:
df2 = pd.DataFrame(data)

In [35]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [36]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [37]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)

In [38]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [39]:
df1[df1 > 0] = 'A'

In [40]:
df2[df2 > 0] = 'B'

In [41]:
df3[df3 > 0] = 'C'

In [42]:
df4 = pd.concat([df1,df2,df3])

In [43]:
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [44]:
df5 = pd.concat([df1,df2,df3],axis=1)

In [45]:
df5

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C